/*-----------------------------------------------
  名稱：8位數碼管顯示其中之一
  編寫：dennis.lin
  日期：2020.9.4
  修改：無
  內容：顯示8位數碼管中任意一位,需將J50短路(即給(74HC373)VCC),
		  並將2條訊號線從P2.2(段鎖) P2.3(位鎖)與J2連接
		  將P0與J3連接
------------------------------------------------*/
#include<reg52.h> //包含標頭檔案，一般情況不需要改動，標頭檔案包含特殊功能暫存器的定義

#define DataPort P0 //定義數據埠 程式中遇到DataPort 則用P0 替換
sbit LATCH1=P2^2;//定義鎖存使能埠 段鎖存
sbit LATCH2=P2^3;//                 位鎖存

/*------------------------------------------------
                    主函式
------------------------------------------------*/
main()
{

	while(1)
	{
		//DataPort=0xfe; //取位碼 讓最左邊7段導通，即二進制1111 1110
		DataPort=0xfc; //取位碼 讓最左邊7段導通，即二進制1111 1100
		LATCH2=1;     //位鎖存
		LATCH2=0;

		DataPort=0x4f; //顯示數據，段碼 「3」共陰字元碼
		LATCH1=1;     //段鎖存
		LATCH1=0;
	}
}
