/*-----------------------------------------------
  名稱：外部中斷1電平觸發
  論壇：www.doflye.net
  編寫：dennis
  日期：2020.10.5
  修改：無
  內容：通過中斷介面P3.3連線的獨立按鍵測試，按一次P1.0口的LED燈反向，
        作用效果和中斷0相同，啟用按鍵去抖，所以適合實際按鍵
------------------------------------------------*/
#include<reg52.h> //包含標頭檔案，一般情況不需要改動，標頭檔案包含特殊功能暫存器的定義

sbit LED=P1^0; //定義LED埠

void DelayUs2x(unsigned char t);//us級延時函式聲明 
void DelayMs(unsigned char t); //ms級延時
/*------------------------------------------------
                    主程式
------------------------------------------------*/
main()
{
	LED=0;         //LED燈點亮
	EA=1;          //全域性中斷開
	EX1=1;         //外部中斷0開
	IT1=0;         //IT1=0表示電平觸發
	while(1)
	{
					  //在此新增其他程式
	}
}
/*------------------------------------------------
                 外部中斷程式
------------------------------------------------*/
void ISR_INT1(void) interrupt 2 
{
 
	if(!INT1)
	{
		DelayMs(10);//在此處可以新增去抖動程式，防止按鍵抖動造成錯誤
		if(!INT1)
		while(!INT1);//等待按鍵釋放
		{
			LED=!LED;   
		}
	}
}

/*------------------------------------------------
 uS延時函式，含有輸入參數 unsigned char t，無返回值
 unsigned char 是定義無符號字元變數，其值的範圍是
 0~255 這裡使用晶振12M，精確延時請使用匯編,大致延時
 長度如下 T=tx2+5 uS 
------------------------------------------------*/
void DelayUs2x(unsigned char t)
{   
	while(--t);
}
/*------------------------------------------------
 mS延時函式，含有輸入參數 unsigned char t，無返回值
 unsigned char 是定義無符號字元變數，其值的範圍是
 0~255 這裡使用晶振12M，精確延時請使用匯編
------------------------------------------------*/
void DelayMs(unsigned char t)
{
     
	while(t--)
	{
		//大致延時1mS
		DelayUs2x(245);
		DelayUs2x(245);
	}
}
