 /*-----------------------------------------------
  名稱：74hc164流水燈 串轉並
  編寫：dennis
  日期：2020.10.30
  修改：無
  內容：通過74hc164序列訊號轉並行訊號依次點亮8個LED燈，
        然後依次熄滅8個燈，先下載好該程式，然後用8個杜邦線連線LED排針J9和P1口插針
        J22,端子CLK連線P2.0，A或者B連線P2.1，另外懸空的一端A或B連線至VCC，共需要11根杜邦線
------------------------------------------------*/
#include<reg52.h> //包含標頭檔案，一般情況不需要改動，標頭檔案包含特殊功能暫存器的定義

sbit CLK=P2^0;    //序列時鐘
sbit INPUT=P2^1;  //序列數據
/*------------------------------------------------
                   延時子程式
------------------------------------------------*/
void delay(unsigned int cnt) 
{
	while(--cnt);
}

void SetData(unsigned char temp)
{
	unsigned char i;
	for(i=0;i<8;i++)
	{
		INPUT=temp&0x01;//取最後一位賦值
		temp>>=1;       //右移
		CLK=0;          //上升沿作用
		CLK=1;
		delay(30000);   //演示有助於觀察效果
	}
}

/*------------------------------------------------
                    主函式
------------------------------------------------*/
void main()
{
	while(1)
	{
		SetData(0x00);
		SetData(0xff);
	}
}
