/*-----------------------------------------------
  名稱：看門狗溢出實驗
  論壇：www.doflye.net
  編寫：dennis
  日期：2020.10.5
  修改：無
  內容：通過按鍵模擬看門狗溢出
------------------------------------------------*/
#include<reg52.h>

sfr  WDTRST  =   0xA6;			 	

sbit key = P3^1;		 

/*------------------------------------------------
                    餵狗
------------------------------------------------*/
void Rst_Watchdog( void )
{
	WDTRST  = 0x1E; //先賦值1E 然後賦值E1
	WDTRST  = 0xE1;
}

/*------------------------------------------------
                    主函式
------------------------------------------------*/
void main( void )
{
	int i;
	                            // 設定看門狗時間為1個時鐘循環后
	Rst_Watchdog();
	     	                    //關看門狗一個時鐘循環
	for( i = 0; i < 500; i++)
	{
		Rst_Watchdog();                
	}
   P1=0x00;
	
	while(!key)                 //按下按鍵不鬆開，表示程式一直在按鍵處循環，
                                //並用LED顯示0x55
	{
		P1=0x55; 	                //模擬出錯 正常情況應該一直顯示LED，
                                //但是加看門狗之後不間斷復位，倒是LED閃爍
	}
}
