 
/*-----------------------------------------------
  名稱：串列埠通訊
  網站：www.doflye.net
  編寫：dennis
  日期：2020.10.10
  修改：無
  內容：連線好串列埠或者usb轉串列埠至電腦，下載該程式，打開電源
        打開串列埠除錯程式，將波特率設定為9600，無奇偶校驗
        晶振11.0592MHz，發送和接收使用的格式相同，如都使用
        字元型格式，按復位重啟程式，可以看到接收到 UART test，技術論壇：www.doflye.net 請在發送區輸入任意信
		  然後在發送區發送任意資訊，接收區返回同樣資訊，表明串列埠收發無誤
------------------------------------------------*/

#include<reg52.h> //包含標頭檔案，一般情況不需要改動，標頭檔案包含特殊功能暫存器的定義                        

/*------------------------------------------------
                   函式聲明
------------------------------------------------*/
void SendStr(unsigned char *s);

/*------------------------------------------------
                    串列埠初始化
------------------------------------------------*/
void InitUART  (void)
{
	SCON  = 0x50;		        // SCON: 模式 1, 8-bit UART, 使能接收  
	TMOD |= 0x20;               // TMOD: timer 1, mode 2, 8-bit 重灌
	TH1   = 0xFD;               // TH1:  重灌值 9600 波特率 晶振 11.0592MHz  
	TR1   = 1;                  // TR1:  timer 1 打開                         
	EA    = 1;                  //打開總中斷
	// ES    = 1;                  //打開串列埠中斷
}                            
/*------------------------------------------------
                    主函式
------------------------------------------------*/
void main (void)
{

	InitUART();

	SendStr("UART test：www.doflye.net ");

	ES = 1;                  //打開串列埠中斷
	while (1)                       
	{

	}
}

/*------------------------------------------------
                    發送一個位元組
------------------------------------------------*/
void SendByte(unsigned char dat)
{
	SBUF = dat;
	while(!TI);
		TI = 0;
}
/*------------------------------------------------
                    發送一個字串
------------------------------------------------*/
void SendStr(unsigned char *s)
{
	while(*s!='\0')// \0 表示字串結束標誌，通過檢測是否字串末尾
	{
		SendByte(*s);
		s++;
	}
}
/*------------------------------------------------
                     串列埠中斷程式
------------------------------------------------*/
void UART_SER (void) interrupt 4 //序列中斷服務程式
{
	unsigned char Temp;          //定義臨時變數 

	if(RI)                        //判斷是接收中斷產生
	{
		RI=0;                      //標誌位清零
		Temp=SBUF;                 //讀入緩衝區的值
		P1=Temp;                   //把值輸出到P1口，用於觀察
		SBUF=Temp;                 //把接收到的值再發回電腦端
	}
	if(TI)                        //如果是發送標誌位，清零
		TI=0;
} 

