/*-----------------------------------------------
  名稱：看門狗溢出實驗 按鍵不停餵狗
  論壇：www.doflye.net
  編寫：dennis
  日期：2020.10.5
  修改：無
  內容：通過按鍵餵狗防止溢出復位 看門狗演示程式  
        在16383個機器週期內必須至少餵狗一次
        標準AT89s52微控制器試驗通過。
------------------------------------------------*/
#include <reg52.h>

sfr WDTRST = 0xA6;

sbit  K1 = P3^0; 
sbit  K2 = P3^1;
sbit  LED1=P1^1;
sbit  LED2=P1^2;

void DelayUs2x(unsigned char t);//us級延時函式聲明 
void DelayMs(unsigned char t); //ms級延時
/*------------------------------------------------
                    主函式
------------------------------------------------*/
main()
{
	LED1=0;
	DelayMs(100);
	LED1=1;
	DelayMs(100);

	TMOD=0x01;
	TH0=0xc6;      //定時16ms
	TL0=0x66;
	EA=1;
	ET0=1;

	WDTRST=0x1e;   //在程式初始化中啟用看門狗。
	WDTRST=0xe1;   //先送1E,後送E1

	if(K1==0)
	{
		TR0=1;
	}

	while(1)
	{    
		if(K2==0)
		{
			TR0=0;
		}
		LED2=1;
		LED1=1;
		DelayMs(100);
		LED2=0;
		DelayMs(100);
	}
}
/*------------------------------------------------
              定時器中斷函式
------------------------------------------------*/
void Time0(void) interrupt 1
{
	TH0=0xc6;      //定時16ms
	TL0=0x66;

	WDTRST=0x1e;   //餵狗指令
	WDTRST=0xe1;
}

/*------------------------------------------------
 uS延時函式，含有輸入參數 unsigned char t，無返回值
 unsigned char 是定義無符號字元變數，其值的範圍是
 0~255 這裡使用晶振12M，精確延時請使用匯編,大致延時
 長度如下 T=tx2+5 uS 
------------------------------------------------*/
void DelayUs2x(unsigned char t)
{   
	while(--t);
}
/*------------------------------------------------
 mS延時函式，含有輸入參數 unsigned char t，無返回值
 unsigned char 是定義無符號字元變數，其值的範圍是
 0~255 這裡使用晶振12M，精確延時請使用匯編
------------------------------------------------*/
void DelayMs(unsigned char t)
{
     
	while(t--)
	{
		//大致延時1mS
		DelayUs2x(245);
		DelayUs2x(245);
	}
}
