 
/*-----------------------------------------------
  名稱：串列埠通訊
  網站：www.doflye.net
  編寫：dennis
  日期：2020.10.9
  修改：無
  內容：連線好串列埠或者usb轉串列埠至電腦，下載該程式，打開電源
        打開串列埠除錯程式，將波特率設定為9600，無奇偶校驗
        晶振11.0592MHz，發送和接收使用的格式相同，如都使用
        字元型格式，設定正確後接受框可以看到UART test，技術論壇：www.doflye.net thank you!
------------------------------------------------*/

#include<reg52.h> //包含標頭檔案，一般情況不需要改動，標頭檔案包含特殊功能暫存器的定義                        
#include"delay.h"
/*------------------------------------------------
                   函式聲明
------------------------------------------------*/
void SendStr(unsigned char *s);
/*------------------------------------------------
                    串列埠初始化
------------------------------------------------*/
void InitUART  (void)
{

	SCON  = 0x50;		        // SCON: 模式 1, 8-bit UART, 使能接收  
	TMOD |= 0x20;               // TMOD: timer 1, mode 2, 8-bit 重灌
	TH1   = 0xFD;               // TH1:  重灌值 9600 波特率 晶振 11.0592MHz  
	TR1   = 1;                  // TR1:  timer 1 打開                         
	EA    = 1;                  //打開總中斷
	//ES    = 1;                  //打開串列埠中斷
}                            
/*------------------------------------------------
                    主函式
------------------------------------------------*/
void main (void)
{

	InitUART();

	while (1)                       
	{
		SendStr("UART test：www.doflye.net thank you!");
		DelayMs(240);//延時循環發送
		DelayMs(240);
	}
}

/*------------------------------------------------
                    發送一個位元組
------------------------------------------------*/
void SendByte(unsigned char dat)
{
	SBUF = dat;
	while(!TI);
		TI = 0;
}
/*------------------------------------------------
                    發送一個字串
------------------------------------------------*/
void SendStr(unsigned char *s)
{
	while(*s!='\0')  // \0 表示字串結束標誌，通過檢測是否字串末尾					
	{
		SendByte(*s);
		s++;
	}
}
